jgrivera67/McRTOS/inc/BoardSupport/LPC2478-STK/lpc2478_ethernet.h
/**
 * @file lpc2478_ethernet.h
 *
 * LPC2478 Ethernet Controller 
 *
 * @author German Rivera 
 */ 
#ifndef _LPC2478_ETHERNET_H
#define _LPC2478_ETHERNET_H

#include "hardware_abstractions.h"
#include "compile_time_checks.h"

/**
 * Base address for the Ethernet controller
 */
#define LPC2478_ETHERNET_BASE_ADDR    UINT32_C(0xFFE00000)

/**
 * Register space size for the ETHERNET
 */
#define LPC2478_ETHERNET_SIZE    UINT32_C(0xFFC)

/**
 * Memory-mapped I/O registers of the ETHERNET
 */
typedef volatile struct lpc2478_ethernet
{
    /*
     * MAC registers
     */

    /**
     * /R/W MAC configuration register 1.
     */ 
    uint32_t reg_MAC1;

    /**
     * Set this to allow receive frames to be received. Internally the MAC synchronizes
     * this control bit to the incoming receive stream.
     */ 
#   define  ETH_MAC1_RECEIVE_ENABLE_MASK    BIT(0)

    /** 
     * When enabled (set to ’1’), the MAC will pass all frames regardless of type (normal
     * vs. Control). When disabled, the MAC does not pass valid Control frames.
     */ 
#   define  ETH_MAC1_PASS_ALL_FRAMES_MASK    BIT(1)

    /** 
     * When enabled (set to ’1’), the MAC acts upon received PAUSE Flow Control
     * frames. When disabled, received PAUSE Flow Control frames are ignored.
     */ 
#   define  ETH_MAC1_RX_FLOW_CONTROL_MASK    BIT(2)

    /** 
     * When enabled (set to ’1’), PAUSE Flow Control frames are allowed to be
     * transmitted. When disabled, Flow Control frames are blocked.
     */ 
#   define  ETH_MAC1_TX_FLOW_CONTROL_MASK    BIT(3)

    /** 
     * Setting this bit will cause the MAC Transmit interface to be looped back to the MAC
     * Receive interface. Clearing this bit results in normal operation.
     */ 
#   define  ETH_MAC1_LOOPBACK_MASK          BIT(4)

#   define  ETH_MAC1_UNUSED1_MASK           MULTI_BIT_MASK(7, 5)
#   define  ETH_MAC1_UNUSED1_SHIFT          5

    /** 
     * Setting this bit will put the Transmit Function logic in reset.
     */ 
#   define  ETH_MAC1_RESET_TX_MASK          BIT(8)

    /** 
     * Setting this bit resets the MAC Control Sublayer / Transmit logic. The MCS logic
     * implements flow control.
     */ 
#   define  ETH_MAC1_RESET_MCS_TX_MASK      BIT(9)

    /** 
     * Setting this bit will put the Ethernet receive logic in reset. 
     */ 
#   define  ETH_MAC1_RESET_RX_MASK          BIT(10)

    /** 
     * Setting this bit resets the MAC Control Sublayer / Receive logic. The MCS logic
     * implements flow control.
     */ 
#   define  ETH_MAC1_RESET_MCS_RX_MASK      BIT(11)

    /** 
     * Reserved. User software should not write ones to reserved bits. The value read
     * from a reserved bit is not defined.
     */ 
#   define  ETH_MAC1_RESERVED1_MASK         MULTI_BIT_MASK(13, 12)
#   define  ETH_MAC1_RESERVED1_SHIFT        12

    /** 
     * Setting this bit will cause a reset to the random number generator within the
     * Transmit Function.
     */ 
#   define  ETH_MAC1_SIMULATION_RESET_MASK  BIT(14)

    /** 
     * Setting this bit will put all modules within the MAC in reset except the Host
     * Interface.
     */ 
#   define  ETH_MAC1_SOFT_RESET_MASK        BIT(15)

    /** 
     * Reserved.
     */ 
#   define  ETH_MAC1_RESERVED2_MASK         MULTI_BIT_MASK(31, 16)
#   define  ETH_MAC1_RESERVED2_SHIFT        16

    /**
     * R/W MAC configuration register 2. 
     */
    uint32_t reg_MAC2;

    /** 
     * When enabled (set to ’1’), the MAC operates in Full-Duplex mode. When disabled,
     * the MAC operates in Half-Duplex mode.
     */ 
#   define  ETH_MAC2_FULL_DUPLEX_MASK           BIT(0)

    /** 
     * When enabled (set to ’1’), both transmit and receive frame lengths are compared to
     * the Length/Type field. If the Length/Type field represents a length then the check is
     * performed. Mismatches are reported in the StatusInfo word for each received frame.
     */ 
#   define  ETH_MAC2_FRAME_LENGTH_CHECKING_MASK BIT(1)

    /** 
     * When enabled (set to ’1’), frames of any length are transmitted and received. 
     */ 
#   define  ETH_MAC2_HUGE_FRAME_ENABLE_MASK BIT(2)

    /** 
     * This bit determines the number of bytes, if any, of proprietary header information
     * that exist on the front of IEEE 802.3 frames. When 1, four bytes of header (ignored
     * by the CRC function) are added. When 0, there is no proprietary header.
     */ 
#   define  ETH_MAC2_DELAYED_CRC_MASK       BIT(3)

    /** 
     * Set this bit to append a CRC to every frame whether padding was required or not.
     * Must be set if PAD/CRC ENABLE is set. Clear this bit if frames presented to the
     * MAC contain a CRC.
     */ 
#   define  ETH_MAC2_CRC_ENABLE_MASK        BIT(4)

    /** 
     * Set this bit to have the MAC pad all short frames. Clear this bit if frames presented
     * to the MAC have a valid length. This bit is used in conjunction with AUTO PAD
     * ENABLE and VLAN PAD ENABLE, as shown below:
     * 
     * MAC2[7] MAC2[6] MAC2[5] Action
     * x       x       0       No pad or CRC check
     * 0       0       1       Pad to 60 bytes, append CRC
     * x       1       1       Pad to 64 bytes, append CRC
     * 1       0       1       If untagged, pad to 60 bytes and append CRC. If VLAN tagged:
     *                         pad to 64 bytes and append CRC.
     */ 
#   define  ETH_MAC2_PAD_CRC_ENABLE_MASK    BIT(5)

    /** 
     * Set this bit to cause the MAC to pad all short frames to 64 bytes and append a valid
     * CRC.
     * Note: This bit is ignored if PAD / CRC ENABLE is cleared.
     */ 
#   define  ETH_MAC2_VLAN_PAD_ENABLE_MASK    BIT(6)

    /** 
     * Set this bit to cause the MAC to automatically detect the type of frame, either tagged
     * or un-tagged, by comparing the two octets following the source address with
     * 0x8100 (VLAN Protocol ID) and pad accordingly.
     * Note: This bit is ignored if PAD / CRC ENABLE is cleared.
     */ 
#   define  ETH_MAC2_AUTO_DETECT_PAD_MASK    BIT(7)

    /** 
     * When enabled (set to ’1’), the MAC will verify the content of the preamble to ensure
     * it contains 0x55 and is error-free. A packet with an incorrect preamble is discarded.
     * When disabled, no preamble checking is performed.
     */ 
#   define  ETH_MAC2_PURE_PREAMBLE_ENFORCEMENT_MASK    BIT(8)

    /** 
     * When enabled (set to ’1’), the MAC only allows receive packets which contain
     * preamble fields less than 12 bytes in length. When disabled, the MAC allows any
     * length preamble as per the Standard.
     */ 
#   define  ETH_MAC2_LONG_PREAMBLE_ENFORCEMENT_MASK    BIT(9)

    /** 
     * Reserved. 
     */ 
#   define  ETH_MAC2_RESERVED1_MASK         MULTI_BIT_MASK(11, 10)
#   define  ETH_MAC2_RESERVED1_SHIFT        10

    /** 
     * When enabled (set to ’1’), the MAC will immediately retransmit following a collision
     * rather than using the Binary Exponential Backoff algorithm as specified in the
     * Standard.
     */ 
#   define  ETH_MAC2_NO_BACKOFF_MASK    BIT(12)

    /** 
     * When enabled (set to ’1’), after the MAC incidentally causes a collision during back
     * pressure, it will immediately retransmit without backoff, reducing the chance of
     * further collisions and ensuring transmit packets get sent.
     */ 
#   define  ETH_MAC2_BACK_PRESSURE_NO_BACKOFF_MASK    BIT(13)

    /** 
     * When enabled (set to ’1’) the MAC will defer to carrier indefinitely as per the
     * Standard. When disabled, the MAC will abort when the excessive deferral limit is
     * reached.
     */ 
#   define  ETH_MAC2_EXCESS_DEFER_MASK    BIT(14)

    /** 
     * Reserved. 
     */ 
#   define  ETH_MAC2_RESERVED2_MASK         MULTI_BIT_MASK(31, 15)
#   define  ETH_MAC2_RESERVED2_SHIFT        15

    /**
     * R/W Back-to-Back Inter-Packet-Gap register.
     */ 
    uint32_t reg_IPGT;

    /** 
     * This is a programmable field representing the nibble time offset of the minimum
     * possible period between the end of any transmitted packet to the beginning of the
     * next. In Full-Duplex mode, the register value should be the desired period in
     * nibble times minus 3. In Half-Duplex mode, the register value should be the
     * desired period in nibble times minus 6. In Full-Duplex the recommended setting is
     * 0x15 (21d), which represents the minimum IPG of 960 ns (in 100 Mbps mode) or
     * 9.6 us (in 10 Mbps mode). In Half-Duplex the recommended setting is 0x12 (18d),
     * which also represents the minimum IPG of 960 ns (in 100 Mbps mode) or 9.6 us
     * (in 10 Mbps mode).
     */ 
#   define  ETH_IPGT_BACK_TO_BACK_INTER_PACKET_GAP_MASK         MULTI_BIT_MASK(6, 0)
#   define  ETH_IPGT_BACK_TO_BACK_INTER_PACKET_GAP_SHIFT        0
#   define  ETH_IPGT_BACK_TO_BACK_INTER_PACKET_GAP_FULL_VALUE   0x15
#   define  ETH_IPGT_BACK_TO_BACK_INTER_PACKET_GAP_HALF_VALUE   0x12
    
    /** 
     * Reserved. 
     */ 
#   define  ETH_IPGT_RESERVED1_MASK         MULTI_BIT_MASK(31, 7)
#   define  ETH_IPGT_RESERVED1_SHIFT        0

    /** 
     * R/W Non Back-to-Back Inter-Packet-Gap register.
     */ 
    uint32_t reg_IPGR;

    /** 
     * This is a programmable field representing the Non-Back-to-Back
     * Inter-Packet-Gap. The recommended value is 0x12 (18d), which
     * represents the minimum IPG of 960 ns (in 100 Mbps mode) or 9.6 us (in
     * 10 Mbps mode).
     */ 
#   define  ETH_IPGR_NON_BACK_TO_BACK_INTER_PACKET_GAP_PART2_MASK         MULTI_BIT_MASK(6, 0)
#   define  ETH_IPGR_NON_BACK_TO_BACK_INTER_PACKET_GAP_PART2_SHIFT        0
#   define  ETH_IPGR_NON_BACK_TO_BACK_INTER_PACKET_GAP_PART2_VALUE        0x12

    /** 
     * Reserved. 
     */ 
#   define  ETH_IPGR_RESERVED1_MASK           BIT(7)

    /** 
     * This is a programmable field representing the optional carrierSense
     * window referenced in IEEE 802.3/4.2.3.2.1 'Carrier Deference'. If carrier is
     * detected during the timing of IPGR1, the MAC defers to carrier. If,
     * however, carrier becomes active after IPGR1, the MAC continues timing
     * IPGR2 and transmits, knowingly causing a collision, thus ensuring fair
     * access to medium. Its range of values is 0x0 to IPGR2. The recommended
     * value is 0xC (12d)
     */ 
#   define  ETH_IPGR_NON_BACK_TO_BACK_INTER_PACKET_GAP_PART1_MASK         MULTI_BIT_MASK(14, 8)
#   define  ETH_IPGR_NON_BACK_TO_BACK_INTER_PACKET_GAP_PART1_SHIFT        8
#   define  ETH_IPGR_NON_BACK_TO_BACK_INTER_PACKET_GAP_PART1_VALUE        0xC

    /** 
     * Reserved. 
     */ 
#   define  ETH_IPGR_RESERVED2_MASK         MULTI_BIT_MASK(31, 15)
#   define  ETH_IPGR_RESERVED2_SHIFT        15

    /** 
     * R/W Collision window / Retry register.
     */ 
    uint32_t reg_CLRT;

    /** 
     * This is a programmable field specifying the number of retransmission attempts
     * following a collision before aborting the packet due to excessive collisions. The
     * Standard specifies the attemptLimit to be 0xF (15d). See IEEE 802.3/4.2.3.2.5.
     */
#   define  ETH_CLRT_RETRANSMISSION_MAXIMUM_MASK         MULTI_BIT_MASK(3, 0)
#   define  ETH_CLRT_RETRANSMISSION_MAXIMUM_SHIFT        0
#   define  ETH_CLRT_RETRANSMISSION_MAXIMUM_VALUE        0xF

    /** 
     * Reserved. 
     */ 
#   define  ETH_CLRT_RESERVED1_MASK         MULTI_BIT_MASK(7, 4)
#   define  ETH_CLRT_RESERVED1_SHIFT        4

    /** 
     * This is a programmable field representing the slot time or collision window during
     * which collisions occur in properly configured networks. The default value of 0x37
     * (55d) represents a 56 byte window following the preamble and SFD.
     */
#   define  ETH_CLRT_COLLISION_WINDOW_MASK  MULTI_BIT_MASK(13, 8)
#   define  ETH_CLRT_COLLISION_WINDOW_SHIFT 8
#   define  ETH_CLRT_COLLISION_WINDOW_VALUE 0x37

    /** 
     * Reserved. 
     */ 
#   define  ETH_CLRT_RESERVED2_MASK         MULTI_BIT_MASK(31, 14)
#   define  ETH_CLRT_RESERVED2_SHIFT        14

    /** 
     * R/W Maximum Frame register.
     */ 
    uint32_t reg_MAXF;

    /** 
     * This field resets to the value 0x0600, which represents a maximum receive frame of
     * 1536 octets. An untagged maximum size Ethernet frame is 1518 octets. A tagged
     * frame adds four octets for a total of 1522 octets. If a shorter maximum length
     * restriction is desired, program this 16 bit field.
     */ 
#   define  ETH_MAXF_MAXIMUM_FRAME_LENGTH_MASK  MULTI_BIT_MASK(15, 0)
#   define  ETH_MAXF_MAXIMUM_FRAME_LENGTH_SHIFT 0

    /** 
     * Reserved. 
     */ 
#   define  ETH_MAXF_RESERVED_MASK              MULTI_BIT_MASK(31, 16)
#   define  ETH_MAXF_RESERVED_SHIFT             16

    /** 
     * R/W PHY Support register.
     */ 
     uint32_t reg_SUPP;

     /** 
      * Reserved. 
      */ 
#   define  ETH_SUPP_RESERVED1_MASK         MULTI_BIT_MASK(7, 0)
#   define  ETH_SUPP_RESERVED1_SHIFT        0

     /**
      * This bit configures the Reduced MII logic for the current operating speed. When set,
      * 100 Mbps mode is selected. When cleared, 10 Mbps mode is selected.
      */ 
#   define  ETH_SUPP_SPEED_MASK             BIT(8)

     /** 
      * Reserved. 
      */ 
#   define  ETH_SUPP_RESERVED2_MASK         MULTI_BIT_MASK(31, 9)
#   define  ETH_SUPP_RESERVED2_SHIFT        9

    /** 
     * R/W Test register.
     */ 
     uint32_t reg_TEST;

    /** 
     * This bit reduces the effective PAUSE quanta from 64 byte-times to 1 byte-time.
     */ 
#   define  ETH_TEST_SHORTCUT_PAUSE_QUANTA_MASK    BIT(0)

    /** 
     * This bit causes the MAC Control sublayer to inhibit transmissions, just as if a
     * PAUSE Receive Control frame with a nonzero pause time parameter was received.
     */ 
#   define  ETH_TEST_PAUSE_MASK         BIT(1)

    /** 
     * Setting this bit will cause the MAC to assert backpressure on the link. Backpressure
     * causes preamble to be transmitted, raising carrier sense. A transmit packet from the
     * system will be sent during backpressure.
     */ 
#   define  ETH_TEST_BACKPRESSURE_MASK  BIT(2)

    /** 
     * Reserved.
     */ 
#   define  ETH_TEST_RESERVED_MASK      MULTI_BIT_MASK(31, 3)
#   define  ETH_TEST_RESERVED_SHIFT     3

     
    /** 
     * R/W MII Mgmt Configuration register.
     */ 
    uint32_t reg_MCFG;

    /** 
     * Set this bit to cause the MII Management hardware to perform read cycles across a
     * range of PHYs. When set, the MII Management hardware will perform read cycles
     * from address 1 through the value set in PHY ADDRESS[4:0]. Clear this bit to allow
     * continuous reads of the same PHY.
     */ 
#   define  ETH_MCFG_SCAN_INCREMENT_MASK    BIT(0)

    /** 
     * Set this bit to cause the MII Management hardware to perform read/write cycles
     * without the 32 bit preamble field. Clear this bit to cause normal cycles to be
     * performed. Some PHYs support suppressed preamble.
     */ 
#   define  ETH_MCFG_SUPPRESS_PREAMBLE_MASK BIT(1)

    /** 
     * This field is used by the clock divide logic in creating the MII Management Clock
     * (MDC) which IEEE 802.3u defines to be no faster than 2.5 MHz. Some PHYs
     * support clock rates up to 12.5 MHz, however. Values for this field are
     * from enum eth_mcfg_clock_select.
     */ 
#   define  ETH_MCFG_CLOCK_SELECT_MASK      MULTI_BIT_MASK(4, 2)
#   define  ETH_MCFG_CLOCK_SELECT_SHIFT     2

    /** 
     * Reserved. 
     */ 
#   define  ETH_MCFG_RESERVED1_MASK         MULTI_BIT_MASK(14, 5)
#   define  ETH_MCFG_RESERVED1_SHIFT        5

    /** 
     * This bit resets the MII Management hardware.
     */ 
#   define  ETH_MCFG_RESET_MII_MGMT_MASK    BIT(15)

    /** 
     * Reserved. 
     */ 
#   define  ETH_MCFG_RESERVED2_MASK         MULTI_BIT_MASK(31, 16)
#   define  ETH_MCFG_RESERVED2_SHIFT        16
    
    /** 
     * R/W MII Mgmt Command register.
     */ 
    uint32_t reg_MCMD;

    /** 
     * This bit causes the MII Management hardware to perform a single Read cycle.
     * The Read data is returned in Register MRDD (MII Mgmt Read Data).
     */ 
#   define  ETH_MCMD_READ_MASK      BIT(0)

    /** 
     * This bit causes the MII Management hardware to perform Read cycles continuously. This is
     * useful for monitoring Link Fail for example.
     */ 
#   define  ETH_MCMD_SCAN_MASK      BIT(1)

    /** 
     * Reserved. 
     */ 
#   define  ETH_MCMD_RESERVED_MASK  MULTI_BIT_MASK(31, 2)
#   define  ETH_MCMD_RESERVED_SHIFT 2

    /** 
     * R/W MII Mgmt Address register.
     */ 
    uint32_t reg_MADR;

    /** 
     * This field represents the 5 bit Register Address of a MII register.
     * Values for this field are from enum eth_mii_register_indexes.
     */ 
#   define  ETH_MADR_REGISTER_ADDRESS_MASK         MULTI_BIT_MASK(4, 0)
#   define  ETH_MADR_REGISTER_ADDRESS_SHIFT        0

    /** 
     * Reserved. 
     */ 
#   define  ETH_MADR_RESERVED1_MASK         MULTI_BIT_MASK(7, 5)
#   define  ETH_MADR_RESERVED1_SHIFT        5

    /** 
     * This field represents the 5 bit PHY Address field of Mgmt
     * cycles. Up to 31 PHYs can be addressed (0 is reserved).
     */ 
#   define  ETH_MADR_PHY_ADDRESS_MASK         MULTI_BIT_MASK(12, 8)
#   define  ETH_MADR_PHY_ADDRESS_SHIFT        8
#   define  ETH_MADR_MIN_PHY_ADDRESS          0x1
#   define  ETH_MADR_MAX_PHY_ADDRESS          0x1f

    /** 
     * Reserved. 
     */ 
#   define  ETH_MADR_RESERVED2_MASK         MULTI_BIT_MASK(31, 13)
#   define  ETH_MADR_RESERVED2_SHIFT        13
    
    /** 
     * WO MII Mgmt Write Data register.
     */ 
    uint32_t reg_MWTD;

    /** 
     * When written, an MII Mgmt write cycle is performed using the 16 bit
     * data and the pre-configured PHY and Register addresses from the
     * MII Mgmt Address register (MADR).
     */ 
#   define  ETH_MWTD_WRITE_DATA_MASK         MULTI_BIT_MASK(15, 0)
#   define  ETH_MWTD_WRITE_DATA_SHIFT        0

    /** 
     * Reserved. 
     */ 
#   define  ETH_MWTD_RESERVED_MASK          MULTI_BIT_MASK(31, 16)
#   define  ETH_MWTD_RESERVED_SHIFT         16

    /** 
     * RO MII Mgmt Read Data register.
     */ 
    uint32_t reg_MRDD;

    /** 
     * Following an MII Mgmt Read Cycle, the 16 bit data can be read from
     * this location.
     */ 
#   define  ETH_MRDD_READ_DATA_MASK         MULTI_BIT_MASK(15, 0)
#   define  ETH_MRDD_READ_DATA_SHIFT        0

    /** 
     * Reserved. 
     */ 
#   define  ETH_MRDD_RESERVED_MASK          MULTI_BIT_MASK(31, 16)
#   define  ETH_MRDD_RESERVED_SHIFT         16

    /** 
     * RO MII Mgmt Indicators register.
     */ 
    uint32_t reg_MIND;
    /** 
     * When ’1’ is returned - indicates MII Mgmt is currently performing an
     * MII Mgmt Read or Write cycle.
     */ 
#   define  ETH_MIND_BUSY_MASK          BIT(0)

    /** 
     * When ’1’ is returned - indicates a scan operation (continuous MII
     * Mgmt Read cycles) is in progress.
     */ 
#   define  ETH_MIND_SCANNING_MASK      BIT(1)

    /** 
     * When ’1’ is returned - indicates MII Mgmt Read cycle has not
     * completed and the Read Data is not yet valid.
     */ 
#   define  ETH_MIND_NOT_VALID_MASK     BIT(2)

    /** 
     * When ’1’ is returned - indicates that an MII Mgmt link fail has
     * occurred.
     */ 
#   define  ETH_MIND_MII_LINK_FAIL_MASK BIT(3)

    /** 
     * Reserved. 
     */ 
#   define  ETH_MIND_RESERVED_MASK      MULTI_BIT_MASK(31, 4)
#   define  ETH_MIND_RESERVED_SHIFT     4

    /**
     * Reserved, user software should not write ones to
     * reserved bits. The value read from a reserved bit
     * is not defined.
     */
    uint32_t reg_reserved1[0x2];

    /** 
     * R/W Station Address registers
     *
     * reg_SA[0] = (2nd octet, 1st octet)
     * reg_SA[1] = (4th octet, 3rd octet)
     * reg_SA[2] = (6th octet, 5th octet)
     */ 
    uint32_t reg_SA[3];

    /** 
     * Most significant octet of pair of octets. 
     */ 
#   define  ETH_SA_HIGH_OCTET_MASK         MULTI_BIT_MASK(7, 0)
#   define  ETH_SA_HIGH_OCTET_SHIFT        0

    /** 
     * Least significant octet of pair of octets. 
     */ 
#   define  ETH_SA_LOW_OCTET_MASK         MULTI_BIT_MASK(15, 8)
#   define  ETH_SA_LOW_OCTET_SHIFT        8

    /** 
     * Reserved. 
     */ 
#   define  ETH_SA_RESERVED_MASK         MULTI_BIT_MASK(31, 16)
#   define  ETH_SA_RESERVED_SHIFT        16

    /** 
     * Reserved
     */ 
    uint32_t reg_reserved2[0x2D];

