jgrivera67/McRTOS/inc/BoardSupport/LPC2478-STK/lpc2478_ethernet.h
    /* 
     * Control registers
     */ 

    /** 
     * R/W Command register.
     */ 
    uint32_t reg_Command;

    /** 
     * Enable receive.
     */ 
#   define  ETH_CMD_RX_ENABLE_MASK  BIT(0)

    /** 
     * Enable transmit.
     */ 
#   define  ETH_CMD_TX_ENABLE_MASK  BIT(1)

    /** 
     * Reserved. 
     */ 
#   define  ETH_CMD_RESERVED1_MASK  BIT(2)

    /** 
    * When a ’1’ is written, all datapaths and the host registers are
    * reset. The MAC needs to be reset separately.
    */ 
#   define  ETH_CMD_REG_RESET_MASK  BIT(3)

    /** 
     * When a ’1’ is written, the transmit datapath is reset. 
     */ 
#   define  ETH_CMD_TX_RESET_MASK   BIT(4)

    /** 
     * When a ’1’ is written, the receive datapath is reset. 
     */ 
#   define  ETH_CMD_RX_RESET_MASK   BIT(5)
    
    /** 
     * When set to ’1’, passes runt frames smaller than 64 bytes to
     * memory unless they have a CRC error. If ’0’ runt frames are
     * filtered out.
     */ 
#   define  ETH_CMD_PASS_RUNT_FRAME_MASK    BIT(6)

    /** 
     * When set to ’1’, disables receive filtering i.e. all frames
     * received are written to memory.
     */
#   define  ETH_CMD_PASS_RX_FILTER_MASK     BIT(7)

    /** 
     * Enable IEEE 802.3 / clause 31 flow control sending pause
     * frames in full duplex and continuous preamble in half duplex.
     */ 
#   define  ETH_CMD_TX_FLOW_CONTROL_MASK    BIT(8)

    /** 
     * When set to ’1’, RMII mode is selected; if ’0’, MII mode is
     * selected.
     */ 
#   define  ETH_CMD_RMII_MASK               BIT(9)

    /** 
     * When set to ’1’, indicates full duplex operation.
     */ 
#   define  ETH_CMD_FULL_DUPLEX_MASK        BIT(10)
    
    /** 
     * Reserved. 
     */ 
#   define  ETH_CMD_RESERVED2_MASK          MULTI_BIT_MASK(31, 11)
#   define  ETH_CMD_RESERVED2_SHIFT         11

    /** 
     * RO Status register.
     */ 
    uint32_t reg_Status;

    /** 
     * If 1, the receive channel is active. If 0, the receive channel is inactive.
     */ 
#   define  ETH_STS_RX_STATUS_MASK       BIT(0)

    /** 
     * If 1, the transmit channel is active. If 0, the transmit channel is inactive.
     */ 
#   define  ETH_STS_TX_STATUS_MASK       BIT(1)

    /** 
     * Reserved. 
     */ 
#   define  ETH_STS_RESERVED_MASK        MULTI_BIT_MASK(31, 2)
#   define  ETH_STS_RESERVED_SHIFT       2

    /** 
     * R/W Receive descriptor base address register.
     */ 
    uint32_t reg_RxDescriptor;

    /** 
     * Fixed to ’00’, since the Rx descriptor base address is
     * 4-byte aligned aligned. 
     */ 
#   define  ETH_RXDES_RESERVED_MASK     MULTI_BIT_MASK(1, 0)
#   define  ETH_RXDES_RESERVED_SHIFT    0

    /** 
     * MSBs of receive descriptor base address.
     */ 
#   define  ETH_RXDES_RX_DESCRIPTOR_MASK    MULTI_BIT_MASK(31, 2)
#   define  ETH_RXDES_RX_DESCRIPTOR_SHIFT   2
    
    /** 
     * R/W Receive status base address register.
     */ 
    uint32_t reg_RxStatus;

    /** 
     * Fixed to ’000’, since the Rx status base address is
     * 8-byte aligned. 
     */ 
#   define  ETH_RXSTS_RESERVED_MASK     MULTI_BIT_MASK(2, 0)
#   define  ETH_RXSTS_RESERVED_SHIFT    0

    /** 
     * MSBs of receive status base address.
     */ 
#   define  ETH_RXSTS_RX_STATUS_MASK    MULTI_BIT_MASK(31, 3)
#   define  ETH_RXSTS_RX_STATUS_SHIFT   3

    /** 
     * R/W Receive number of descriptors register.
     */ 
    uint32_t reg_RxDescriptorNumber;

    /** 
     * Number of descriptors in the descriptor array for which
     * RxDescriptor is the base address. The number of
     * descriptors is minus one encoded.
     */ 
#   define  ETH_RXDN_RX_DESCRIPTOR_NUMBER_MASK         MULTI_BIT_MASK(15, 0)
#   define  ETH_RXDN_RX_DESCRIPTOR_NUMBER_SHIFT        0

    /** 
     * Reserved. 
     */ 
#   define  ETH_MWTD_RESERVED_MASK          MULTI_BIT_MASK(31, 16)
#   define  ETH_MWTD_RESERVED_SHIFT         16
    
    /** 
     * RO Receive produce index register.
     */ 
    uint32_t reg_RxProduceIndex;

    /** 
     * Index of the descriptor that is going to be filled next by the
     * receive datapath.
     */ 
#   define  ETH_RXPI_RX_PRODUCE_INDEX_MASK  MULTI_BIT_MASK(15, 0)
#   define  ETH_RXPI_RX_PRODUCE_INDEX_SHIFT 0

    /** 
     * Reserved. 
     */ 
#   define  ETH_RXPI_RESERVED_MASK          MULTI_BIT_MASK(31, 16)
#   define  ETH_RXPI_RESERVED_SHIFT         16

    /** 
     * R/W Receive consume index register.
     */ 
    uint32_t reg_RxConsumeIndex;

    /** 
     * Index of the descriptor that is going to be processed next by
     * the receive
     */ 
#   define  ETH_RXCI_RX_CONSUME_INDEX_MASK  MULTI_BIT_MASK(15, 0)
#   define  ETH_RXCI_RX_CONSUME_INDEX_SHIFT 0
    
    /** 
     * Reserved. 
     */ 
#   define  ETH_RXCI_RESERVED_MASK          MULTI_BIT_MASK(31, 16)
#   define  ETH_RXCI_RESERVED_SHIFT         16

    /** 
     * R/W Transmit descriptor base address register.
     */ 
    uint32_t reg_TxDescriptor;

    /** 
     * Fixed to ’00’, since the Tx descriptor base address is
     * 4-byte aligned aligned. 
     */ 
#   define  ETH_TXDES_RESERVED_MASK     MULTI_BIT_MASK(1, 0)
#   define  ETH_TXDES_RESERVED_SHIFT    0

    /** 
     * MSBs of transmit descriptor base address.
     */ 
#   define  ETH_TXDES_TX_DESCRIPTOR_MASK    MULTI_BIT_MASK(31, 2)
#   define  ETH_TXDES_TX_DESCRIPTOR_SHIFT   2

    /** 
     * R/W Transmit status base address register.
     */ 
    uint32_t reg_TxStatus;

    /** 
     * Fixed to ’00’, since the Tx status base address is
     * 4-byte aligned. 
     */ 
#   define  ETH_TXSTS_RESERVED_MASK     MULTI_BIT_MASK(1, 0)
#   define  ETH_TXSTS_RESERVED_SHIFT    0

    /** 
     * MSBs of transmit status base address.
     */ 
#   define  ETH_TXSTS_TX_STATUS_MASK    MULTI_BIT_MASK(31, 2)
#   define  ETH_TXSTS_TX_STATUS_SHIFT   2

    /** 
     * R/W Transmit number of descriptors register.
     */ 
    uint32_t reg_TxDescriptorNumber;

    /** 
     * Number of descriptors in the descriptor array for which
     * TxDescriptor is the base address. The register is minus
     * one encoded.
     */ 
#   define  ETH_TXDN_TX_DESCRIPTOR_NUMBER_MASK  MULTI_BIT_MASK(15, 0)
#   define  ETH_TXDN_TX_DESCRIPTOR_NUMBER_SHIFT 0
    
    /** 
     * Reserved. 
     */ 
#   define  ETH_TXDN_RESERVED_MASK              MULTI_BIT_MASK(31, 16)
#   define  ETH_TXDN_RESERVED_SHIFT             16

    /** 
     * R/W Transmit produce index register.
     */ 
    uint32_t reg_TxProduceIndex;

    /** 
     * Index of the descriptor that is going to be filled next by the
     * transmit software driver.
     */ 
#   define  ETH_TXPI_TX_PRODUCE_INDEX_MASK  MULTI_BIT_MASK(15, 0)
#   define  ETH_TXPI_TX_PRODUCE_INDEX_SHIFT 0
    
    /** 
     * Reserved. 
     */ 
#   define  ETH_TXPI_RESERVED_MASK          MULTI_BIT_MASK(31, 16)
#   define  ETH_TXPI_RESERVED_SHIFT         16

    /** 
     * RO Transmit consume index register.
     */ 
    uint32_t reg_TxConsumeIndex;

    /** 
     * Index of the descriptor that is going to be transmitted next by
     * the transmit datapath
     */ 
#   define  ETH_TXCI_TX_CONSUME_INDEX_MASK  MULTI_BIT_MASK(15, 0)
#   define  ETH_TXCI_TX_CONSUME_INDEX_SHIFT 0
    
    /** 
     * Reserved. 
     */ 
#   define  ETH_TXCI_RESERVED_MASK          MULTI_BIT_MASK(31, 16)
#   define  ETH_TXCI_RESERVED_SHIFT         16

    /** 
     * Reserved
     */ 
    uint32_t reg_reserved3[0xA];

    /** 
     * RO Transmit status vector register 0 (TSV first part).
     */ 
    uint32_t reg_TSV0;

    /** 
     * The attached CRC in the packet did not match the
     * internally generated CRC.
     */ 
#   define  ETH_TSV0_CRC_ERROR_MASK             BIT(0)

    /** 
     * Indicates the frame length field does not match the actual
     * number of data items and is not a type field.
     */ 
#   define  ETH_TSV0_LENGTH_CHECK_ERROR_MASK    BIT(1)

    /** 
     * range Indicates that frame type/length field was larger than
     * 1500 bytes.
     *
     * NOTE: The EMAC doesn't distinguish the frame type and frame length,
     * so, e.g. when the IP(0x8000) or ARP(0x0806) packets are received, it
     * compares the frame type with the max length and gives the "Length
     * out of range" error. In fact, this bit is not an error indication,
     * but simply a statement by the chip regarding the status of the received
     * frame.
     */ 
#   define  ETH_TSV0_LENGTH_OUT_OF_RANGE_MASK   BIT(2)

    /** 
     * Transmission of packet was completed. 
     */ 
#   define  ETH_TSV0_DONE_MASK                  BIT(3)

    /** 
     * Packet’s destination was a multicast address.
     */ 
#   define  ETH_TSV0_MULTICAST_MASK             BIT(4)

    /** 
     * Packet’s destination was a broadcast address.
     */ 
#   define  ETH_TSV0_BROADCAST_MASK             BIT(5)

    /** 
     * Packet was deferred for at least one attempt, but less than
     * an excessive defer.
     */ 
#   define  ETH_TSV0_PACKET_DEFER_MASK          BIT(6)

    /** 
     * Packet was deferred in excess of 6071 nibble times in
     * 100 Mbps or 24287 bit times in 10 Mbps mode.
     */ 
#   define  ETH_TSV0_EXCESSIVE_DEFER_MASK       BIT(7)

    /** 
     * Packet was aborted due to exceeding of maximum allowed
     * number of collisions.
     */ 
#   define  ETH_TSV0_EXCESSIVE_COLLISION_MASK   BIT(8)

    /** 
     * Collision occurred beyond collision window, 512 bit times.
     */ 
#   define  ETH_TSV0_LATE_COLLISION_MASK        BIT(9)
    
    /** 
     * Byte count in frame was greater than can be represented
     * in the transmit byte count field in TSV1.
     */ 
#   define  ETH_TSV0_GIANT_MASK                 BIT(10)

    /** 
     * Host side caused buffer underrun.
     */ 
#   define  ETH_TSV0_UNDERRUN_MASK              BIT(11)
    /** 
     * The total number of bytes transferred including collided
     * attempts.
     */ 
#   define  ETH_TSV0_TOTAL_BYTES_MASK           MULTI_BIT_MASK(27, 12)
#   define  ETH_TSV0_TOTAL_BYTES_SHIFT          12 

    /** 
     * The frame was a control frame. 
     */ 
#   define  ETH_TSV0_CONTROL_FRAME_MASK         BIT(28)

    /** 
     * The frame was a control frame with a valid PAUSE
     * opcode.
     */ 
#   define  ETH_TSV0_PAUSE_MASK                 BIT(29)

    /** 
     * Carrier-sense method backpressure was previously
     * applied.
     */ 
#   define  ETH_TSV0_BACKPRESSURE_MASK          BIT(30)

    /** 
     * Frame’s length/type field contained 0x8100 which is the
     * VLAN protocol identifier.
     */ 
#   define  ETH_TSV0_VLAN_MASK                  BIT(31)
    
    /** 
     * RO Transmit status vector register 1 (TSV second part).
     */ 
    uint32_t reg_TSV1;

    /** 
     * The total number of bytes in the frame, not counting the
     * collided bytes.
     */ 
#   define  ETH_TSV1_TRANSMIT_BYTE_COUNT_MASK   MULTI_BIT_MASK(15, 0)
#   define  ETH_TSV1_TRANSMIT_BYTE_COUNT_SHIFT  0

    /** 
     * Number of collisions the current packet incurred during
     * transmission attempts. The maximum number of collisions
     * (16) cannot be represented.
     */ 
#   define  ETH_TSV1_TRANSMIT_COLLISION_COUNT_MASK  MULTI_BIT_MASK(19, 16)
#   define  ETH_TSV1_TRANSMIT_COLLISION_COUNT_SHIFT 16 

    /** 
     * Reserved. 
     */ 
#   define  ETH_TSV1_RESERVED_MASK                  MULTI_BIT_MASK(31, 20)
#   define  ETH_TSV1_RESERVED_SHIFT                 20

    /** 
     * RO Receive status vector register.
     */ 
    uint32_t reg_RSV;

    /** 
     * Indicates length of received frame.
     */ 
#   define  ETH_RSV_RECEIVED_BYTE_COUNT_MASK         MULTI_BIT_MASK(15, 0)
#   define  ETH_RSV_RECEIVED_BYTE_COUNT_SHIFT        0

    /** 
     * Indicates that a packet was dropped.
     */ 
#   define  ETH_RSV_PACKET_PREVIOUSLY_IGNORED_MASK  BIT(16)

    /** 
    * Indicates that the last receive event seen was not long
    * enough to be a valid packet.
    */ 
#   define  ETH_RSV_RXDV_EVENT_PREVIOUSLY_SEEN_MASK BIT(17)

    /** 
     * Indicates that at some time since the last receive statistics,
     * a carrier event was detected.
     */ 
#   define  ETH_RSV_CARRIER_EVENT_PREVIOUSLY_SEEN_MASK  BIT(18)

    /** 
     * Indicates that MII data does not represent a valid receive
     * code.
     */ 
#   define  ETH_RSV_RECEIVE_CODE_VIOLATION_MASK         BIT(19)

    /** 
     * The attached CRC in the packet did not match the
     * internally generated CRC.
     */ 
#   define  ETH_RSV_CRC_ERROR_MASK                      BIT(20)

    /** 
     * Indicates the frame length field does not match the actual
     * number of data items and is not a type field.
     */ 
#   define  ETH_RSV_LENGTH_CHECK_ERROR_MASK             BIT(21)

    /** 
     * Indicates that frame type/length field was larger than
     * 1518 bytes.
     */ 
#   define  ETH_RSV_LENGTH_OUT_OF_RANGE_MASK            BIT(22)

    /** 
     * The packet had valid CRC and no symbol errors.
     */ 
#   define  ETH_RSV_RECEIVE_OK_MASK                     BIT(23)

    /** 
     * Multicast The packet destination was a multicast address. 
     */ 
#   define  ETH_RSV_MULTICAST_MASK                      BIT(24)

    /** 
     * The packet destination was a broadcast address.
     */ 
#   define  ETH_RSV_BROADCAST_MASK                      BIT(25)

    /** 
     * Indicates that after the end of packet another 1-7 bits were
     * received. A single nibble, called dribble nibble, is formed
     * but not sent out.
     */ 
#   define  ETH_RSV_DRIBBLE_NIBBLE_MASK                 BIT(26)

    /** 
     * The frame was a control frame.
     */ 
#   define  ETH_RSV_CONTROL_FRAME_MASK                  BIT(27)

    /** 
     * The frame was a control frame with a valid PAUSE
     * opcode.
     */ 
#   define  ETH_RSV_PAUSE_MASK                          BIT(28)

    /** 
     * The current frame was recognized as a Control Frame but
     * contains an unknown opcode.
     */ 
#   define  ETH_RSV_UNSUPPORTED_OPCODE_MASK             BIT(29)

    /** 
     * Frame’s length/type field contained 0x8100 which is the
     * VLAN protocol identifier.
     */ 
#   define  ETH_RSV_VLAN_MASK                           BIT(30)

    /** 
     * Reserved
     */ 
#   define  ETH_RSV_RESERVED_MASK                       BIT(31)
    
    /** 
     * Reserved
     */ 
    uint32_t reg_reserved4[0x3];

    /** 
     * R/W Flow control counter register.
     */ 
    uint32_t reg_FlowControlCounter;

    /** 
     * In full duplex mode the MirrorCounter specifies the number
     * of cycles before re-issuing the Pause control frame.
     */ 
#   define  ETH_FCC_MIRROR_COUNTER_MASK         MULTI_BIT_MASK(15, 0)
#   define  ETH_FCC_MIRROR_COUNTER_SHIFT        0

    /** 
     * In full-duplex mode the PauseTimer specifies the value
     * that is inserted into the pause timer field of a pause flow
     * control frame. In half duplex mode the PauseTimer
     * specifies the number of backpressure cycles.
     */ 
#   define  ETH_FCC_PAUSE_TIMER_MASK            MULTI_BIT_MASK(31, 16)
#   define  ETH_FCC_PAUSE_TIMER_SHIFT           16 
    
    /** 
     * RO Flow control status register.
     */ 
    uint32_t reg_FlowControlStatus;

    /** 
     * In full duplex mode this register represents the current
     * value of the datapath’s mirror counter which counts up to
     * the value specified by the MirrorCounter field in the
     * FlowControlCounter register. In half duplex mode the
     * register counts until it reaches the value of the PauseTimer
     * bits in the FlowControlCounter register.
     */ 
#   define  ETH_FCS_MIRROR_COUNTER_CURRENT_MASK     MULTI_BIT_MASK(15, 0)
#   define  ETH_FCS_MIRROR_COUNTER_CURRENT_SHIFT    0

    /** 
     * Reserved. 
     */ 
#   define  ETH_FCS_RESERVED_MASK                   MULTI_BIT_MASK(31, 16)
#   define  ETH_FCS_RESERVED_SHIFT                  16

    /** 
     * Reserved
     */ 
    uint32_t reg_reserved5[0x22];

