jgrivera67/McRTOS/inc/BoardSupport/LPC2478-STK/lpc2478_ethernet.h
    /* 
     * Rx filter registers
     */

    /** 
     * Receive filter control register.
     */ 
    uint32_t reg_RxFliterCtrl;

    /** 
     * When set to ’1’, all unicast frames are accepted.
     */ 
#   define  ETH_RXFC_ACCEPT_UNICAST_EN_MASK    BIT(0)

    /** 
     * When set to ’1’, all broadcast frames are accepted.
     */ 
#   define  ETH_RXFC_AcceptBroadcastEn_MASK    BIT(1)

    /** 
     * When set to ’1’, all multicast frames are accepted.
     */ 
#   define  ETH_RXFC_ACCEPT_MULTICAST_EN_MASK    BIT(2)

    /** 
     * When set to ’1’, unicast frames that pass the imperfect
     * hash filter are accepted.
     */ 
#   define  ETH_RXFC_ACCEPT_UNICAST_HASH_EN_MASK    BIT(3)

    /** 
     * When set to ’1’, multicast frames that pass the
     * imperfect hash filter are accepted.
     */ 
#   define  ETH_RXFC_ACCEPT_MULTICAST_HASH_EN_MASK  BIT(4)

    /** 
     * When set to ’1’, the frames with a destination address
     * identical to the station address are accepted.
     */ 
#   define  ETH_RXFC_ACCEPT_PERFECT_EN_MASK     BIT(5)

    /** 
     * Reserved. 
     */ 
#   define  ETH_RXFC_RESERVED1_MASK             MULTI_BIT_MASK(11, 6)
#   define  ETH_RXFC_RESERVED1_SHIFT            6

    /** 
     * MagicPacketEnWoL When set to ’1’, the result of the magic packet filter will
     * generate a WoL interrupt when there is a match.
     */ 
#   define  ETH_RXFC_MAGIC_PACKET_EN_WOL_MASK   BIT(12)

    /** 
     * When set to ’1’, the result of the perfect address
     * matching filter and the imperfect hash filter will
     * generate a WoL interrupt when there is a match.
     */ 
#   define  ETH_RXFC_RX_FILTER_EN_WOL_MASK      BIT(13)

    /** 
     * Reserved. 
     */ 
#   define  ETH_RXFC_RESERVED2_MASK             MULTI_BIT_MASK(31, 14)
#   define  ETH_RXFC_RESERVED2_SHIFT            14
    
    /** 
     * Receive filter WoL status register.
     */ 
    uint32_t reg_RxFilterWoLStatus;

    /** 
     * When the value is ’1’, a unicast frames caused WoL.
     */ 
#   define  ETH_RXFS_ACCEPT_UNICAST_WOL_MASK    BIT(0)

    /** 
     * When the value is ’1’, a broadcast frame caused WoL.
     */ 
#   define  ETH_RXFS_ACCEPT_BROADCAST_WOL_MASK  BIT(1)

    /** 
     * When the value is ’1’, a multicast frame caused WoL.
     */ 
#   define  ETH_RXFS_ACCEPT_MULTICAST_WOL_MASK  BIT(2)

    /** 
     * When the value is ’1’, a unicast frame that passes the
     * imperfect hash filter caused WoL.
     */ 
#   define  ETH_RXFS_ACCEPT_UNICAST_HASH_WOL_MASK   BIT(3)

    /** 
     * When the value is ’1’, a multicast frame that passes the
     * imperfect hash filter caused WoL.
     */ 
#   define  ETH_RXFS_ACCEPT_MULTICAST_HASH_WOL_MASK BIT(4)

    /** 
     * AcceptPerfectWoL When the value is ’1’, the perfect address matching filter
     * caused WoL.
     */ 
#   define  ETH_RXFS_ACCEPT_PERFECT_WOL_MASK    BIT(5)

    /** 
     * Reserved. 
     */ 
#   define  ETH_RXFS_RESERVED1_MASK             BIT(6)

    /** 
     * When the value is ’1’, the receive filter caused WoL.
     */ 
#   define  ETH_RXFS_RX_FILTER_WOL_MASK         BIT(7)

    /** 
     * When the value is ’1’, the magic packet filter caused
     * WoL.
     */ 
#   define  ETH_RXFS_MAGIC_PACKET_WOL_MASK      BIT(8)

    /** 
     * Reserved. 
     */ 
#   define  ETH_RXFS_RESERVED2_MASK         MULTI_BIT_MASK(31, 9)
#   define  ETH_RXFS_RESERVED2_SHIFT        9

    
    /** 
     * Receive filter WoL clear register.
     */ 
    uint32_t reg_RxFilterWoLClear;

    /** 
     * When a ’1’ is written to one of these bits (0 to 5), the
     * corresponding status bit in the RxFilterWoLStatus
     * register is cleared.
     */ 
#   define  ETH_RXFWC_ACCEPT_UNICAST_WOL_CLR_MASK           BIT(0)
#   define  ETH_RXFWC_ACCEPT_BROADCAST_WOL_CLR_MASK         BIT(1)
#   define  ETH_RXFWC_ACCEPT_MULTICAST_WOL_CLR_MASK         BIT(2)
#   define  ETH_RXFWC_Accept_Unicast_HASH_WOL_CLR_MASK      BIT(3)
#   define  ETH_RXFWC_ACCEPT_MULTICAST_HASH_WOL_CLR_MASK    BIT(4)

#   define  ETH_RXFWC_ACCEPT_PERFECT_WOL_CLR_MASK           BIT(5)

    /** 
     * Reserved. 
     */ 
#   define  ETH_RXFWC_RESERVED1_MASK                        BIT(6)

    /** 
     * When a ’1’ is written to one of these bits (7 and/or 8),
     * the corresponding status bit in the RxFilterWoLStatus
     * register is cleared.
     */ 
#   define  ETH_RXFWC_RX_FILTER_WOL_CLR_MASK                BIT(7)
#   define  ETH_RXFWC_MAGIC_PACKET_WOL_CLR_MASK             BIT(8)

    /** 
     * Reserved. 
     */ 
#   define  ETH_RXFWC_RESERVED2_MASK          MULTI_BIT_MASK(31, 9)
#   define  ETH_RXFWC_RESERVED2_SHIFT         9

    /** 
     * Reserved
     */ 
    uint32_t reg_reserved6;

    /** 
     * Hash filter table LSBs register (low part).
     * Bit 31:0 of the imperfect filter hash table for receive
     * filtering.
     */
    uint32_t reg_HashFilterL;

    /** 
     * Hash filter table MSBs register (high part).
     * Bit 63:32 of the imperfect filter hash table for receive
     * filtering.
     */ 
    uint32_t reg_HashFilterH;

    /** 
     * Reserved
     */ 
    uint32_t reg_reserved7[0x372];

    /* 
     * Module control registers
     */ 

    /** 
     * RO Interrupt status register.
     */ 
    uint32_t reg_IntStatus;

    /** 
     * Interrupt set on a fatal overrun error in the receive queue. The
     * fatal interrupt should be resolved by a Rx soft-reset. The bit is not
     * set when there is a nonfatal overrun error.
     */ 
#   define  ETH_INTST_RX_OVERRUN_INT_MASK    BIT(0)

    /** 
     * Interrupt trigger on receive errors: AlignmentError, RangeError,
     * LengthError, SymbolError, CRCError or NoDescriptor or Overrun.
     */ 
#   define  ETH_INTST_RX_ERROR_INT_MASK      BIT(1)

    /** 
     * Interrupt triggered when all receive descriptors have been
     * processed i.e. on the transition to the situation where
     * ProduceIndex == ConsumeIndex.
     */ 
#   define  ETH_INTST_RX_FINISHED_INT_MASK   BIT(2)

    /** 
     * Interrupt triggered when a receive descriptor has been processed
     * while the Interrupt bit in the Control field of the descriptor was set.
     */ 
#   define  ETH_INTST_RX_DONE_INT_MASK       BIT(3)

    /** 
     * Interrupt set on a fatal underrun error in the transmit queue. The
     * fatal interrupt should be resolved by a Tx soft-reset. The bit is not
     * set when there is a nonfatal underrun error.
     */ 
#   define  ETH_INTST_TX_UNDERRUN_INT_MASK   BIT(4)

    /** 
     * Interrupt trigger on transmit errors: LateCollision,
     * ExcessiveCollision and ExcessiveDefer, NoDescriptor or
     * Underrun.
     */ 
#   define  ETH_INTST_TX_ERROR_INT_MASK      BIT(5)

    /** 
     * Interrupt triggered when all transmit descriptors have been
     * processed i.e. on the transition to the situation where
     * ProduceIndex == ConsumeIndex.
     */ 
#   define  ETH_INTST_TX_FINISHED_INT_MASK   BIT(6)

    /** 
     * Interrupt triggered when a descriptor has been transmitted while
     * the Interrupt bit in the Control field of the descriptor was set.
     */ 
#   define  ETH_INTST_TX_DONE_INT_MASK       BIT(7)

    /** 
     * Reserved. 
     */ 
#   define  ETH_INTST_RESERVED1_MASK     MULTI_BIT_MASK(11, 8)
#   define  ETH_INTST_RESERVED1_SHIFT    8

    /** 
     * Interrupt triggered by software writing a 1 to the SoftintSet bit in
     * the IntSet register.
     */ 
#   define  ETH_INTST_SOFT_INT_MASK      BIT(12)

    /** 
     * Interrupt triggered by a Wakeup event detected by the receive
     * filter.
     */ 
#   define  ETH_INTST_WAKEUP_INT_MASK    BIT(13)

    /** 
     * Reserved. 
     */ 
#   define  ETH_INTST_RESERVED2_MASK     MULTI_BIT_MASK(31, 14)
#   define  ETH_INTST_RESERVED2_SHIFT    14

    /** 
     * R/W Interrupt enable register.
     */ 
    uint32_t reg_IntEnable;

    /** 
     * Enable for interrupt trigger on receive buffer overrun or
     * descriptor underrun situations.
     */ 
#   define  ETH_INTE_RX_OVERRUN_INT_EN_MASK    BIT(0)

    /** 
     * Enable for interrupt trigger on receive errors.
     */ 
#   define  ETH_INTE_RX_ERROR_INT_EN_MASK    BIT(1)

    /** 
     * Enable for interrupt triggered when all receive descriptors have
     * been processed i.e. on the transition to the situation where
     * ProduceIndex == ConsumeIndex.
     */ 
#   define  ETH_INTE_RX_FINISHED_INT_EN_MASK    BIT(2)

    /** 
     * Enable for interrupt triggered when a receive descriptor has
     * been processed while the Interrupt bit in the Control field of the
     * descriptor was set.
     */ 
#   define  ETH_INTE_RX_DONE_INT_EN_MASK        BIT(3)

    /** 
     * Enable for interrupt trigger on transmit buffer or descriptor
     * underrun situations.
     */ 
#   define  ETH_INTE_TX_UNDERRUN_INT_EN_MASK    BIT(4)

    /** 
     * Enable for interrupt trigger on transmit errors.
     */ 
#   define  ETH_INTE_TX_ERROR_INT_EN_MASK    BIT(5)

    /** 
     * Enable for interrupt triggered when all transmit descriptors
     * have been processed i.e. on the transition to the situation
     * where ProduceIndex == ConsumeIndex.
     */ 
#   define  ETH_INTE_TX_FINISHED_INT_EN_MASK    BIT(6)

    /** 
     * Enable for interrupt triggered when a descriptor has been
     * transmitted while the Interrupt bit in the Control field of the
     * descriptor was set.
     */ 
#   define  ETH_INTE_TX_DONE_INT_EN_MASK        BIT(7)

    /** 
     * Reserved. 
     */ 
#   define  ETH_INTE_RESERVED1_MASK         MULTI_BIT_MASK(11, 8)
#   define  ETH_INTE_RESERVED1_SHIFT        8

    /** 
     * Enable for interrupt triggered by the SoftInt bit in the IntStatus
     * register, caused by software writing a 1 to the SoftIntSet bit in
     * the IntSet register.
     */ 
#   define  ETH_INTE_SOFT_INT_EN_MASK       BIT(12)

    /** 
     * Enable for interrupt triggered by a Wakeup event detected by
     * the receive filter.
     */ 
#   define  ETH_INTE_WAKEUP_INT_EN_MASK    BIT(13)

    /** 
     * Reserved. 
     */ 
#   define  ETH_INTE_RESERVED2_MASK         MULTI_BIT_MASK(31, 14)
#   define  ETH_INTE_RESERVED2_SHIFT        14
    
    /** 
     * WO Interrupt clear register.
     */ 
    uint32_t reg_IntClear;

    /** 
     * Writing a ’1’ to one of these bits clears (0 to 7) the
     * corresponding status bit in interrupt status register
     * IntStatus.
     */ 
#   define  ETH_INTC_RX_OVERRUN_INT_CLR_MASK    BIT(0)
#   define  ETH_INTC_RX_ERROR_INT_CLR_MASK      BIT(1)
#   define  ETH_INTC_RX_FINISHED_INT_CLR_MASK   BIT(2)
#   define  ETH_INTC_RX_DONE_INT_CLR_MASK       BIT(3)
#   define  ETH_INTC_TX_UNDERRUN_INT_CLR_MASK   BIT(4)
#   define  ETH_INTC_TX_ERROR_INT_CLR_MASK      BIT(5)
#   define  ETH_INTC_TX_FINISHED_INT_CLR_MASK   BIT(6)
#   define  ETH_INTC_Tx_DONE_INT_CLR_MASK       BIT(7)

    /** 
     * Reserved. 
     */ 
#   define  ETH_INTC_RESERVED1_MASK         MULTI_BIT_MASK(11, 8)
#   define  ETH_INTC_RESERVED1_SHIFT        8
    
    /** 
     * Writing a ’1’ to one of these bits (12 and/or 13) clears the
     * corresponding status bit in interrupt status register
     * IntStatus.
     */ 
#   define  ETH_INTC_SOFT_INT_CLR_MASK      BIT(12)
#   define  ETH_INTC_WAKEUP_INT_CLR_MASK    BIT(13)

    /** 
     * Reserved. 
     */ 
#   define  ETH_INTC_RESERVED2_MASK         MULTI_BIT_MASK(31, 14)
#   define  ETH_INTC_RESERVED2_SHIFT        14

    /** 
     * WO Interrupt set register.
     */ 
    uint32_t reg_IntSet;

    /** 
     * Writing a ’1’ to one of these bits sets (0 to 7) the
     * corresponding status bit in interrupt status register
     * IntStatus.
     */ 
#   define  ETH_INTS_RX_OVERRUN_INT_SET_MASK    BIT(0)
#   define  ETH_INTS_RX_ERROR_INT_SET_MASK      BIT(1)
#   define  ETH_INTS_RX_FINISHED_INT_SET_MASK   BIT(2)
#   define  ETH_INTS_RX_DONE_INT_SET_MASK       BIT(3)
#   define  ETH_INTS_TX_UNDERRUN_INT_SET_MASK   BIT(4)
#   define  ETH_INTS_TX_ERROR_INT_SET_MASK      BIT(5)
#   define  ETH_INTS_TX_FINISHED_INT_SET_MASK   BIT(6)
#   define  ETH_INTS_Tx_DONE_INT_SET_MASK       BIT(7)

    /** 
     * Reserved. 
     */ 
#   define  ETH_INTS_RESERVED1_MASK         MULTI_BIT_MASK(11, 8)
#   define  ETH_INTS_RESERVED1_SHIFT        8
    
    /** 
     * Writing a ’1’ to one of these bits (12 and/or 13) sets the
     * corresponding status bit in interrupt status register
     * IntStatus.
     */ 
#   define  ETH_INTS_SOFT_INT_SET_MASK      BIT(12)
#   define  ETH_INTS_WAKEUP_INT_SET_MASK    BIT(13)

    /** 
     * Reserved. 
     */ 
#   define  ETH_INTS_RESERVED2_MASK         MULTI_BIT_MASK(31, 14)
#   define  ETH_INTS_RESERVED2_SHIFT        14

    /** 
     * Reserved
     */ 
    uint32_t reg_reserved8;

    /** 
     * R/W Power-down register.
     */ 
    uint32_t reg_PowerDown;

    /** 
     * Reserved. 
     */ 
#   define  ETH_PWRD_RESERVED_MASK      MULTI_BIT_MASK(30, 0)
#   define  ETH_PWRD_RESERVED_SHIFT     0
    
    /** 
     * If true, all AHB accesses will return a read/write error,
     * except accesses to the PowerDown register
     */ 
#   define  ETH_PWRD_POWER_DOWN_MAC_AHB_MASK    BIT(31)
    
    /** 
     * Reserved
     */ 
    uint32_t reg_reserved9;
} lpc2478_ethernet_t;

