jgrivera67/McRTOS/inc/BoardSupport/LPC2478-STK/lpc2478_ethernet.h
/*
 * Compile-time asserts to verify that the compiler generates
 * the expected offsets for structs that represent groups of memory-mapped
 * I/O registers
 */

C_ASSERT(sizeof(lpc2478_ethernet_t) == LPC2478_ETHERNET_SIZE);

C_ASSERT(offsetof(lpc2478_ethernet_t, reg_MAC1) == 0x00);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_MAC2) == 0x04);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_IPGT) == 0x08);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_IPGR) == 0x0C);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_CLRT) == 0x10);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_MAXF) == 0x14);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_SUPP) == 0x18);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_TEST) == 0x1C);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_MCFG) == 0x20);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_MCMD) == 0x24);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_MADR) == 0x28);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_MWTD) == 0x2C);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_MRDD) == 0x30);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_MIND) == 0x34);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_SA[0]) == 0x40);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_SA[1]) == 0x44);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_SA[2]) == 0x48);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_Command) == 0x100);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_Status) == 0x104);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_RxDescriptor) == 0x108);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_RxStatus) == 0x10C);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_RxDescriptorNumber) == 0x110);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_RxProduceIndex) == 0x114);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_RxConsumeIndex) == 0x118);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_TxDescriptor) == 0x11C);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_TxStatus) == 0x120);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_TxDescriptorNumber) == 0x124);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_TxProduceIndex) == 0x128);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_TxConsumeIndex) == 0x12C);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_TSV0) == 0x158);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_TSV1) == 0x15C);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_RSV) == 0x160);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_FlowControlCounter) == 0x170);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_FlowControlStatus) == 0x174);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_RxFliterCtrl) == 0x200);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_RxFilterWoLStatus) == 0x204);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_RxFilterWoLClear) == 0x208);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_HashFilterL) == 0x210);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_HashFilterH) == 0x214);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_IntStatus) == 0xFE0);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_IntEnable) == 0xFE4);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_IntClear) == 0xFE8);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_IntSet) == 0xFEC);
C_ASSERT(offsetof(lpc2478_ethernet_t, reg_PowerDown) == 0xFF4);

/**
 * Layout of a receive descriptor in memory 
 * (one descriptor per frame fragment)
 */
struct eth_receive_descriptor
{
    /** 
     * Base address of the data buffer for storing receive data.
     */ 
    uint32_t erd_packet;

    /** 
     * Control information
     */ 
    uint32_t erd_control;
   
    /** 
     * Size in bytes of the data buffer. This is the size of the buffer reserved by the
     * device driver for a frame or frame fragment i.e. the byte size of the buffer
     * pointed to by the Packet field. The size is -1 encoded e.g. if the buffer is 8
     * bytes the size field should be equal to 7.
     */ 
#   define  ETH_RXD_SIZE_MASK         MULTI_BIT_MASK(10, 0)
#   define  ETH_RXD_SIZE_SHIFT        0

    /** 
     * Reserved. 
     */ 
#   define  ETH_RXD_RESERVED_MASK         MULTI_BIT_MASK(30, 11)
#   define  ETH_RXD_RESERVED_SHIFT        11
    
    /** 
     * If true generate an RxDone interrupt when the data in this frame or frame
     * fragment and the associated status information has been committed to
     * memory
     */ 
#   define  ETH_RXD_INTERRUPT_MASK    BIT(31)
};

/**
 * Layout of a receive status entry in memory 
 * (one status entry per receive descriptor or received frame fragment)
 */
struct eth_receive_status
{
    /** 
     * Receive status return flags.
     */ 
    uint32_t ers_status_info;

    /** 
     * The size in bytes of the actual data transferred into one fragment buffer. In
     * other words, this is the size of the frame or fragment as actually written by
     * the DMA manager for one descriptor. This may be different from the Size
     * bits of the Control field in the descriptor that indicate the size of the buffer
     * allocated by the device driver. Size is -1 encoded e.g. if the buffer has
     * 8 bytes the RxSize value will be 7.
     */ 
#   define  ETH_RXSI_RX_SIZE_MASK       MULTI_BIT_MASK(10, 0)
#   define  ETH_RXSI_RX_SIZE_SHIFT      0

    /** 
     * Reserved. 
     */ 
#   define  ETH_RXSI_RESERVED2_MASK     MULTI_BIT_MASK(17, 11)
#   define  ETH_RXSI_RESERVED2_SHIFT    11
    
    /** 
     * Indicates this is a control frame for flow control, either a pause frame or a
     * frame with an unsupported opcode.
     */ 
#   define  ETH_RXSI_CONTROl_FRAME_MASK BIT(18)

    /** 
     * Indicates a VLAN frame.
     */ 
#   define  ETH_RXSI_VLAN_MASK          BIT(19)

    /** 
     * Indicates this frame has failed the Rx filter. These frames will not normally
     * pass to memory. But due to the limitation of the size of the buffer, part of
     * this frame may already be passed to memory. Once the frame is found to
     * have failed the Rx filter, the remainder of the frame will be discarded
     * without being passed to the memory. However, if the PassRxFilter bit in
     * the Command register is set, the whole frame will be passed to memory.
     */ 
#   define  ETH_RXSI_FailFilter_MASK    BIT(20)

    /** 
     * Set when a multicast frame is received.
     */ 
#   define  ETH_RXSI_MULTICAST_MASK    BIT(21)

    /** 
     * Set when a broadcast frame is received.
     */ 
#   define  ETH_RXSI_BROADCAST_MASK    BIT(22)

    /** 
     * The received frame had a CRC error.
     */ 
#   define  ETH_RXSI_CRC_ERROR_MASK    BIT(23)

    /** 
     * The PHY reports a bit error over the MII during reception.
     */ 
#   define  ETH_RXSI_SYMBOL_ERROR_MASK  BIT(24)

    /** 
     * The frame length field value in the frame specifies a valid length, but does
     * not match the actual data length.
     */ 
#   define  ETH_RXSI_LENGTH_ERROR_MASK    BIT(25)

    /** 
     * The received packet exceeds the maximum packet size.
     * 
     * NOTE: The EMAC doesn't distinguish the frame type and frame length,
     * so, e.g. when the IP(0x8000) or ARP(0x0806) packets are received,
     * it compares the frame type with the max length and gives the "Range"
     * error. In fact, this bit is not an error indication, but simply a
     * statement by the chip regarding the status of the received frame.
     */ 
#   define  ETH_RXSI_RANGE_ERROR_MASK    BIT(26)

    /** 
     * An alignment error is flagged when dribble bits are detected and also a
     * CRC error is detected. This is in accordance with IEEE std. 802.3/clause
     * 4.3.2.
     */ 
#   define  ETH_RXSI_ALIGNMENT_ERROR_MASK   BIT(27)

    /** 
     * Receive overrun. The adapter can not accept the data stream.
     */ 
#   define  ETH_RXSI_OVERRUN_MASK           BIT(28)

    /** 
     * No new Rx descriptor is available and the frame is too long for the buffer
     * size in the current receive descriptor.
     */
#   define  ETH_RXSI_NO_DESCRIPTOR_MASK     BIT(29)

    /** 
     * When set to 1, indicates this descriptor is for the last fragment of a frame.
     * If the frame consists of a single fragment, this bit is also set to 1.
     */
#   define  ETH_RXSI_LAST_FLAG_MASK         BIT(30)

    /** 
     * An error occurred during reception of this frame. This is a logical OR of
     * AlignmentError, RangeError, LengthError, SymbolError, CRCError, and Overrun.
     */
#   define  ETH_RXSI_ERROR_MASK             BIT(31)

    /** 
     * The concatenation of the destination address hash CRC and
     * the source address hash CRC.
     */ 
    uint32_t ers_status_hash_crc;

    /** 
     * Hash CRC calculated from the source address.
     */ 
#   define  ETH_RXSH_SA_HASH_CRC_MASK         MULTI_BIT_MASK(8, 0)
#   define  ETH_RXSH_SA_HASH_CRC_SHIFT        0

    /** 
     * Reserved. 
     */ 
#   define  ETH_RXSH_RESERVED1_MASK         MULTI_BIT_MASK(15, 9)
#   define  ETH_RXSH_RESERVED1_SHIFT        9
    
    /** 
     * Hash CRC calculated from the destination address.
     */ 
#   define  ETH_RXSH_DA_HASH_CRC_MASK         MULTI_BIT_MASK(24, 16)
#   define  ETH_RXSH_DA_HASH_CRC_SHIFT        16 

    /** 
     * Reserved. 
     */ 
#   define  ETH_RXSH_RESERVED2_MASK         MULTI_BIT_MASK(31, 25)
#   define  ETH_RXSH_RESERVED2_SHIFT        25
};

/**
 * Layout of a transmit descriptor in memory
 * (one descriptor per frame fragment)
 */
struct eth_transmit_descriptor
{
    /** 
     * Base address of the data buffer containing transmit data.
     */ 
    uint32_t etd_packet;
   
    /** 
     * Control information
     */ 
    uint32_t etd_control;

    /** 
     * Size in bytes of the data buffer. This is the size of the frame or fragment as it
     * needs to be fetched by the DMA manager. In most cases it will be equal to the
     * byte size of the data buffer pointed to by the Packet field of the descriptor. Size
     * is -1 encoded e.g. a buffer of 8 bytes is encoded as the Size value 7.
     */ 
#   define  ETH_TXC_SIZE_MASK       MULTI_BIT_MASK(10, 0)
#   define  ETH_TXC_SIZE_SHIFT      0

    /** 
     * Reserved. 
     */ 
#   define  ETH_TXC_RESERVED_MASK   MULTI_BIT_MASK(25, 11)
#   define  ETH_TXC_RESERVED_SHIFT  11
    
    /** 
     * Per frame override. If true, bits 30:27 will override the defaults from the MAC
     * internal registers. If false, bits 30:27 will be ignored and the default values
     * from the MAC will be used.
     */ 
#   define  ETH_TXC_OVERRIDE_MASK   BIT(26)

    /** 
     * If true, enables huge frame, allowing unlimited frame sizes. When false,
     * prevents transmission of more than the maximum frame length (MAXF[15:0]).
     */ 
#   define  ETH_TXC_HUGE_MASK       BIT(27)

    /** 
     * If true, pad short frames to 64 bytes.
     */ 
#   define  ETH_TXC_PAD_MASK        BIT(28)

    /** 
     * If true, append a hardware CRC to the frame.
     */ 
#   define  ETH_TXC_CRC_MASK        BIT(29)

    /** 
     * If true, indicates that this is the descriptor for the last fragment in the transmit
     * frame. If false, the fragment from the next descriptor should be appended.
     */ 
#   define  ETH_TXC_Last_MASK       BIT(30)

    /** 
     * If true, a TxDone interrupt will be generated when the data in this frame or
     * frame fragment has been sent and the associated status information has been
     * committed to memory.
     */ 
#   define  ETH_TXC_INTERRUPT_MASK  BIT(31)
};


/**
 * Layout of a transmit status entry in memory
 * (one status entry per transmit descriptor or transmitted frame fragment)
 */
struct eth_transmit_status
{
    /** 
     * Transmit status return flags
     */ 
    uint32_t ets_status_info;

    /** 
     * Reserved. 
     */ 
#   define  ETH_TXSI_RESERVED_MASK              MULTI_BIT_MASK(20, 0)
#   define  ETH_TXSI_RESERVED_SHIFT             0
    
    /** 
     * The number of collisions this packet incurred, up to the
     * Retransmission Maximum.
     */ 
#   define  ETH_TXSI_COLLISION_COUNT_MASK       MULTI_BIT_MASK(24, 21)
#   define  ETH_TXSI_COLLISION_COUNT_SHIFT      21

    /** 
     * This packet incurred deferral, because the medium was occupied.
     * This is not an error unless excessive deferral occurs.
     */ 
#   define  ETH_TXSI_DEFER_MASK                 BIT(25)

    /** 
     * This packet incurred deferral beyond the maximum deferral limit and
     * was aborted.
     */ 
#   define  ETH_TXSI_EXCESSIVE_DEFER_MASK       BIT(26)

    /** 
     * Indicates this packet exceeded the maximum collision limit and was
     * aborted.
     */ 
#   define  ETH_TXSI_EXCESSIVE_COLLISION_MASK   BIT(27)

    /** 
     * An Out of window Collision was seen, causing packet abort.
     */ 
#   define  ETH_TXSI_LATE_COLLISION_MASK        BIT(28)
    /** 
     * A Tx underrun occurred due to the adapter not producing transmit
     * data.
     */ 
#   define  ETH_TXSI_UNDERRUN_MASK              BIT(29)

    /** 
     * The transmit stream was interrupted because a descriptor was not
     * available.
     */ 
#   define  ETH_TXSI_NO_DESCRIPTOR_MASK         BIT(30)

    /** 
     * An error occurred during transmission. This is a logical OR of
     * Underrun, LateCollision, ExcessiveCollision, and ExcessiveDefer.
     */ 
#   define  ETH_TXSI_ERROR_MASK                 BIT(31)
};

/**
 * Clock select encodings for field ETH_MCFG_CLOCK_SELECT_MASK
 */
enum eth_mcfg_clock_select
{
    ETH_MCFG_HOST_CLOCK_DIVIDED_BY_4 =  0x0, /* 0 0 x */
    ETH_MCFG_HOST_CLOCK_DIVIDED_BY_6 =  0x2, /* 0 1 0 */
    ETH_MCFG_HOST_CLOCK_DIVIDED_BY_8 =  0x3, /* 0 1 1 */
    ETH_MCFG_HOST_CLOCK_DIVIDED_BY_10 = 0x4, /* 1 0 0 */
    ETH_MCFG_HOST_CLOCK_DIVIDED_BY_14 = 0x5, /* 1 0 1 */
    ETH_MCFG_HOST_CLOCK_DIVIDED_BY_20 = 0x6, /* 1 1 0 */
    ETH_MCFG_HOST_CLOCK_DIVIDED_BY_28 = 0x7, /* 1 1 1 */
};

/**
 * Indexes of MII registers
 */
enum eth_mii_register_indexes
{
    ETH_MII_BMCR =          0x00,       // Basic mode control register
    ETH_MII_BMSR =          0x01,       // Basic mode status register
    ETH_MII_PHYSID1 =       0x02,       // PHY identifier 1         
    ETH_MII_PHYSID2 =       0x03,       // PHY identifier 2        
    ETH_MII_ADVERTISE =     0x04,       // Auto-Negotiation Advertisement register
    ETH_MII_LPA =           0x05,       // Auto-Negotiation Link partner ability register
    ETH_MII_EXPANSION =     0x06,       // Auto-Negotiation Expansion register
    ETH_MII_NEXT_PAGE =     0x07,       // Auto-Negotiation Next Page Register
    ETH_MII_LPA_NEXT_PAGE = 0x08,       // Link Partner Next Page Ability register
    ETH_MII_CTRL1000 =      0x09,       // 1000BASE-T control      
    ETH_MII_STAT1000 =      0x0a,       // 1000BASE-T status      
    ETH_MII_ESTATUS =	    0x0f,	// Extended Status 
    ETH_MII_DCOUNTER =      0x12,       // Disconnect counter 
    ETH_MII_FCSCOUNTER =    0x13,       // False carrier counter
    ETH_MII_NWAYTEST =      0x14,       // N-way auto-neg test reg 
    ETH_MII_RX_ER_COUNTER = 0x15,       // Receive error counter  
    ETH_MII_SREVISION =     0x16,       // Silicon revision      
    ETH_MII_RESERVED1 =     0x17,
    ETH_MII_LBRERROR =      0x18,       // Loopback, rx, bypass error 
    ETH_MII_PHYADDR =       0x19,       // PHY address             
    ETH_MII_RESERVED2 =     0x1a, 
    ETH_MII_INT_OR_STATUS = 0x1b,       // Interrupt Control/Status Register  
    ETH_MII_NCONFIG =       0x1c,       // Network interface config
    ETH_MII_100BT_CTRL =    0x1f,       // 100BASE-TX PHY Control Register
};


