jgrivera67/McRTOS/inc/BoardSupport/LPC2478-STK/lpc2478_ethernet.h
/*
 * Basic mode control register flags
 */
#define ETH_MII_BMCR_RESERVED_MASK          MULTI_BIT_MASK(5, 0)
#define ETH_MII_BMCR_SPEED1000_MASK	    BIT(6)  /* MSB of Speed (1000)         */
#define ETH_MII_BMCR_CTST_MASK              BIT(7)  /* Collision test              */
#define ETH_MII_BMCR_FULLDPLX_MASK          BIT(8)  /* Full duplex                 */
#define ETH_MII_BMCR_ANRESTART_MASK         BIT(9)  /* Auto negotiation restart    */
#define ETH_MII_BMCR_ISOLATE_MASK           BIT(10) /* Disconnect DP83840 from MII */
#define ETH_MII_BMCR_PDOWN_MASK             BIT(11) /* Powerdown the DP83840       */
#define ETH_MII_BMCR_ANENABLE_MASK          BIT(12) /* Enable auto negotiation     */
#define ETH_MII_BMCR_SPEED100_MASK          BIT(13) /* Select 100Mbps              */
#define ETH_MII_BMCR_LOOPBACK_MASK          BIT(14) /* TXD loopback bits           */
#define ETH_MII_BMCR_RESET_MASK             BIT(15) /* Reset the DP83840           */

/*
 * Basic mode status register (BMSR) flags
 */
#define ETH_MII_BMSR_ERCAP_MASK             BIT(0)  /* Ext-reg capability          */
#define ETH_MII_BMSR_JCD_MASK               BIT(1)  /* Jabber detected             */
#define ETH_MII_BMSR_LSTATUS_MASK           BIT(2)  /* Link status                 */
#define ETH_MII_BMSR_ANEGCAPABLE_MASK       BIT(3)  /* Able to do auto-negotiation */
#define ETH_MII_BMSR_RFAULT_MASK            BIT(4)  /* Remote fault detected       */
#define ETH_MII_BMSR_ANEGCOMPLETE_MASK      BIT(5)  /* Auto-negotiation complete   */
#define ETH_MII_BMSR_RESERVED_MASK          MULTI_BIT_MASK(7, 6)
#define ETH_MII_BMSR_ESTATEN_MASK	    BIT(8)  /* Extended Status in R15 */
#define ETH_MII_BMSR_100HALF2_MASK          BIT(9)  /* Can do 100BASE-T2 HDX */
#define ETH_MII_BMSR_100FULL2_MASK          BIT(10) /* Can do 100BASE-T2 FDX */
#define ETH_MII_BMSR_10HALF_MASK            BIT(11) /* Can do 10mbps, half-duplex  */
#define ETH_MII_BMSR_10FULL_MASK            BIT(12) /* Can do 10mbps, full-duplex  */
#define ETH_MII_BMSR_100HALF_MASK           BIT(13) /* Can do 100mbps, half-duplex */
#define ETH_MII_BMSR_100FULL_MASK           BIT(14) /* Can do 100mbps, full-duplex */
#define ETH_MII_BMSR_100BASE4_MASK          BIT(15) /* Can do 100mbps, 4k packets  */

/* 
 * Link partner ability register (LPA) flags
 */
#define ETH_MII_LPA_SELECTOR_MASK           MULTI_BIT_MASK(4, 0)
#define ETH_MII_LPA_10BASE_MASK             BIT(5)  // Can do 10mbps
#define ETH_MII_LPA_10BASE_FULL_MASK        BIT(6)  // Can do 10mbps full-duplex
#define ETH_MII_LPA_100BASE_MASK            BIT(7)  // Can do 100mbps
#define ETH_MII_LPA_100BASE_FULL_MASK       BIT(8)  // Can do 100mbps full-duplex
#define ETH_MII_LPA_100BASE_T4_MASK         BIT(9)  // Can do 100mbps 4k packets
#define ETH_MII_LPA_PAUSE_CAP_MASK          BIT(10) // Can pause               
#define ETH_MII_LPA_PAUSE_ASYM_MASK         BIT(11) // Can pause asymetrically
#define ETH_MII_LPA_RESERVED_MASK           BIT(12) // Unused
#define ETH_MII_LPA_REMOTE_FAULT_MASK       BIT(13) // Link partner faulted
#define ETH_MII_LPA_ACK_MASK                BIT(14) // Link partner acked us
#define ETH_MII_LPA_NEXT_PAGE_MASK          BIT(15) // Next page bit

/**
 * Maximum size of an Ethernet frame fragment in bytes
 */
#define ETH_MAX_FRAGMENT_SIZE   (2 * UINT32_C(1024))

C_ASSERT(ETH_MAX_FRAGMENT_SIZE % sizeof(uint32_t) == 0);

/**
 * Total number of transmit descriptors
 */
#define ETH_NUM_TRANSMIT_DESCRIPTORS  UINT32_C(384)

/**
 * Total number of receive descriptors
 */
#define ETH_NUM_RECEIVE_DESCRIPTORS  UINT32_C(384)

/**
 * Total number of fragments to store Ethernet headers for outgoing Ethernet
 * frames
 */
#define ETH_NUM_TX_FRAME_HEADER_FRAGMENTS   (ETH_NUM_TRANSMIT_DESCRIPTORS / 2)

/**
 * Total number of fragments to store data payload for outgoing Ethernet frames
 */
#define ETH_NUM_TX_FRAME_DATA_FRAGMENTS \
        (ETH_NUM_TRANSMIT_DESCRIPTORS - ETH_NUM_TX_FRAME_HEADER_FRAGMENTS)

/**
 * Total number of fragments to store Ethernet headers for incoming Ethernet
 * frames
 */
#define ETH_NUM_RX_FRAME_HEADER_FRAGMENTS   (ETH_NUM_RECEIVE_DESCRIPTORS / 2)

/**
 * Total number of fragments to store data payload for incoming Ethernet
 * frames
 */
#define ETH_NUM_RX_FRAME_DATA_FRAGMENTS \
        (ETH_NUM_RECEIVE_DESCRIPTORS - ETH_NUM_RX_FRAME_HEADER_FRAGMENTS)

C_ASSERT(
    (ETH_NUM_TX_FRAME_DATA_FRAGMENTS + ETH_NUM_RX_FRAME_DATA_FRAGMENTS) *
        ETH_MAX_FRAGMENT_SIZE * 64 <= ETHERNET_DATA_FRAGMENT_BUFFER_POOL_SIZE);

#endif /* _LPC2478_ETHERNET_H */
